Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །འཆལ་བའི་ཚུལ་ཁྲིམས་ཅན་དག་གིས།
en: “Still, even if those who observe improper discipline

source: །གོས་འདི་རབ་ཏུ་བགོས་གྱུར་ཀྱང་།
en: Put on such robes,

source: །ང་རྒྱལ་དང་ནི་བག་མེད་པའི།
en: It only causes the strength of pride and carelessness

source: །སེམས་ནི་རབ་ཏུ་འཕེལ་བར་བྱེད།
en: To grow in their minds.

source: །དད་པས་བྱིན་པ་ཅི་ཟོས་པ།
en: “When they eat the food that is donated to them with faith,

source: །ཐུ་ལུམ་འབར་བ་མིད་པ་འདྲ།
en: It is like swallowing burning iron.

source: །དེ་ལྟར་ཁྱིམ་གྱི་གནས་སྤངས་ནས།
en: In that way, after renouncing their households,

source: །འདོད་པ་ལྔ་ཡི་བདེ་བའང་མེད། །གཞན་ཡང་སངས་རྒྱས་ཆོས་དག་ལ།
en: They do not experience sense pleasures,

source: །མཆོག་གི་བདེ་བ་མ་ཐོབ་ནས།
en: “Nor do they gain the supreme happiness

source: །སྤྱོད་པ་འདྲེན་མ་མོས་བྱེད་པས།
en: Associated with the Dharma of the buddhas. In this way, they aspire for a variety of experiences

source: །མཐའ་གཉིས་དག་ནི་སྤོང་མི་འགྱུར། །ཡིད་ཀྱི་མོས་པ་ཇི་སྙེད་པ།
en: And do not abandon the two extremes.

source: །ཐམས་ཅད་ཀྱང་ནི་དག་མི་འགྱུར།
en: “None of their interests are pure,

source: །དེ་འདྲའི་གང་ཟག་བླུན་པོ་ནི། །འཁོར་མང་ནང་དུ་གནས་གྱུར་ཀྱང་།
en: And even when such fools are in a large retinue,

source: །དཔེར་ན་ཇི་ལྟར་ཝ་སྐྱེས་དག །སེང་གེའི་ཁྱུར་ནི་ཞུགས་པ་བཞིན།
en: They are like foxes That have entered a pack of lions.

source: །དེ་ལྟར་རབ་ཏུ་ཞི་བ་ཡི།
en: “Even if you give

source: །ཆོས་ནི་ཡང་དག་བསྟན་བྱས་ཀྱང་།
en: Teachings related to peace, They do not understand or realize

source: །དེ་བཞིན་ཉིད་དང་སྟོང་པའི་དོན། །རྟོགས་ཤིང་ཁོང་དུ་མ་ཆུད་པས།
en: The meaning of suchness and emptiness.

source: །འཁོར་མང་དག་ལ་བསྟན་བསྔགས་ཀྱང་།
en: “Even if their teachings are praised in large retinues,

source: །ཁེངས་པའི་སེམས་ནི་སྐྱེད་པར་བྱེད།
en: This only causes their arrogance to increase;

source: །སྟོན་པ་ཆེན་པོ་མི་དྲན་པས།
en: Since they do not recollect the great teacher,

source: །ངོ་ཚ་དམན་པའི་སེམས་ཀྱང་མེད།
en: They lack modesty and humility.

source: །མི་གཙང་དངོས་པོ་ལེན་བྱེད་ཀྱང་། །ཡིད་བཞིན་ནོར་བུ་ཐོབ་པ་བཞིན།
en: “Even when they take hold of impure objects,

source: །ཤིན་ཏུ་དགའ་བས་འཛིན་བྱེད་པས།
en: They joyfully hold on to them As if they were wish-fulfilling gems,

source: །སེམས་ཀྱིས་ཆུང་ཟད་གཏོང་མི་བྱེད།
en: And their minds never let go of them.

source: །འདི་ལྟ་བུ་ཡི་མ་རབས་དག །ཁྱིམ་ནས་རབ་ཏུ་བྱུང་ནས་ནི།
en: “Though such vile beings Might renounce their households,

source: །སྤྱོད་ལམ་དག་ཀྱང་སྲུང་བ་དང་། །ཆོས་གོས་ལྷུང་བཟེད་འཛིན་བྱེད་ཀྱང་།
en: Guard their behavior, put on Dharma robes, And carry alms bowls,

source: །ཆ་བྱད་ཙམ་དང་ལྡན་པས་ན།
en: “These are all merely superficial displays,

source: །ཡང་དག་ཤེས་རབ་ཅི་ཡང་མེད།
en: And so they utterly lack true insight.

source: །ཁ་སྤུ་དག་ནི་བྲེགས་གྱུར་ཀྱང་།
en: Even if they shave their facial hairs,

source: །སྡིག་པའི་སེམས་ནི་མི་སྤོང་ཞིང་།
en: They do not renounce harmful attitudes.

source: །དགེ་སྦྱོང་མ་ཡིན་པ་ཡི་ཆོས།
en: “Since they follow teachings contrary to virtuous practice

source: །ལོག་ལྟ་དག་ཏུ་ལྷུང་གྱུར་ན།
en: And fall into mistaken views,

source: །རབ་དབེན་མྱ་ངན་འདས་པའི་ལམ།
en: The path leading to disengagement and nirvāṇa

source: །དེ་དག་རབ་ཏུ་ཉམས་པར་འགྱུར། །དགེ་སྦྱོང་མངོན་དུ་བྱ་བ་ཡི།
en: Is completely ruined for them.

source: །འབྲས་བུ་དག་ཀྱང་འཐོབ་མི་འགྱུར།
en: “They will not achieve the fruition Resulting from engaging in virtuous practice,

source: །མ་རིག་ཉོན་མོངས་རྣམས་ཀྱང་ནི།
en: And so their ignorance and other afflictions

source: །རྡུལ་ཙམ་ཉམས་པར་མི་འགྱུར་རོ།
en: Will not diminish in the slightest.

source: །གྲོང་ཁྱེར་དག་ཏུ་རྣམ་རྒྱུ་ཞིང་།
en: “While roaming in the cities,

source: །རང་ཉིད་དབེན་པའི་བསྔགས་བརྗོད་ཀྱང་།
en: They sing the praise of disengagement.

source: །སྐྱེས་བུ་བླུན་པོ་བློ་མེད་པས།
en: Due to their lack of intelligence,

source: །ཡང་དག་བགྲོད་པ་ཤེས་མི་འགྱུར། །སེམས་ཀྱི་འདུན་པ་ཅི་ཡོད་པ།
en: Those fools do not understand the genuine path.

source: །དེ་དག་ཐམས་ཅད་མི་དགེ་ཡིན། །རྙེད་པ་འདོད་པའི་རྒྱུ་ཡི་ཕྱིར།
en: “All their aspirations are nonvirtuous;

source: །དགོན་པ་དག་ན་གནས་བྱེད་ཀྱི།
en: Even if they stay in the wilderness,

source: །མྱ་ངན་འདས་པའི་ཡང་དག་རྒྱུ། །བསྒྲུབ་པའི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: It is not to accomplish the true causes of nirvāṇa, But out of desire for personal gain.

source: །རྨུགས་དང་གཉིད་ལ་རབ་ཏུ་དགའ།
en: “Fond of drowsiness and sleep,

source: །ལུས་ནི་ཇི་ལྟར་བདེ་སྙམ་ནས།
en: They are concerned about their physical well-being

source: །རྟག་ཏུ་དེ་ལྟའི་དངོས་པོ་དག །སྒྲུབ་པ་ལ་ནི་མོས་པར་བྱེད།
en: And constantly long

source: །དགོན་པའི་གནས་ནི་དེ་དག་ཏུ།
en: For ways to accomplish that goal.

source: །ལོ་ནི་མང་པོར་གནས་བྱེད་ཀྱང་།
en: “Even if they stay in the wilderness for many years,

source: །ཕྱིན་ལོག་ལྟ་བར་གྱུར་པའི་ཕྱིར།
en: They adhere to mistaken views,

source: །མྱ་ངན་འདས་ལམ་སྟོར་བས་ན།
en: And so they stray from the path leading to nirvāṇa,

source: །ནམས་ཀྱང་དགེ་སྦྱོང་ལམ་དག་གི །འབྲས་བུ་དག་ནི་ཐོབ་མི་འགྱུར།
en: Never obtaining the results of the paths of virtuous practice.

source: །ཡང་དག་ལྟ་བ་རབ་ཉམས་ཤིང་།
en: “Since they regress from the genuine view

source: །ཚུལ་ཁྲིམས་དག་དང་འགལ་བྱས་པས།
en: And transgress pure discipline,

source: །གོས་བཟང་དག་གིས་ལུས་བརྒྱན་པ། །དེ་ལ་ཤིན་ཏུ་སྲེད་པར་འགྱུར།
en: They always crave fine clothes to adorn their bodies,

source: །འདོད་པའི་བདེ་བ་རྣམས་ལ་ནི། །རྟག་ཏུ་སྲེད་པ་སྐྱེད་པར་བྱེད།
en: And for the happiness of sensual pleasures.

source: །གལ་ཏེ་གྲོང་ཁྱེར་ཞུགས་ན་ཡང་།
en: “When they enter cities,

source: །ང་རྒྱལ་མཚན་མ་སྟོན་བྱེད་ཅིང་།
en: They bear the marks of pride

source: །ལུས་ཀྱི་ལས་ནི་མི་སྲུང་བས།
en: And do not guard their physical actions,

source: །སྤྱོད་ལམ་དག་ལ་གནས་མི་བྱེད།
en: And so they do not observe pure conduct.

source: །རེས་འགའ་གྲོང་ཁྱེར་ཞུགས་ནས་ནི།
en: “At times, when they enter cities and roam about,

source: །རྒྱུ་ཚེ་རང་ཉིད་འདི་སྐད་དུ། །དགོན་པའི་གནས་ནི་དེ་དག་ན། །རི་ཕུག་དག་ནི་གང་ཡོད་པ།
en: They boast about their characteristics in these words:

source: །ཁྱེད་རྣམས་འདི་ལྟར་ཤེས་པར་གྱིས། །དེ་ནི་བདག་གི་གནས་ཡིན་ཏེ།
en: ‘You should know that the caves in the wilderness are my home.

source: །མཐོ་དམའ་རན་པར་ལྟ་བ་དང་། །འགྲོ་གོམ་ཚུལ་ལ་གནས་སོ་ཞེས། །ཐ་དད་མཚན་མའི་ཚིག་བརྗོད་དེ།
en: My eyes downcast, I glance upward slowly, walking and stopping serenely.’

source: །དགྲ་བཅོམ་པ་ཡི་རྟགས་བསྟན་པས།
en: “Since they do indeed look like worthy ones,

source: །ཁྱིམ་པ་དག་ནི་ཇི་སྙེད་པ། །ཕན་ཚུན་དུ་ནི་འདི་སྐད་དུ།
en: All the householders say to one another,

source: །དགོན་པའི་དགེ་སློང་གང་ཡིན་པ།
en: ‘This monk who stays in the wilderness

source: །ཡང་དག་འཕགས་པ་ཡིན་ཞེས་ཟེར།
en: Is truly a noble being!’

source: །རེས་འགའ་དགོན་པ་དེ་དག་ན།
en: “At other times, when visitors come to see them

source: །གནས་པར་གྱུར་པ་དེ་ཡི་ཚེ། །གལ་ཏེ་གཞན་དག་འོངས་གྱུར་ན། །འདི་ལྟ་བུར་ནི་སྟོན་པར་བྱེད།
en: While they stay in the forest, they brag in words such as these:

source: །བདག་ནི་དགོན་གནས་འདི་དག་ཏུ། །ཉིན་མཚན་འཆག་པར་བྱེད་ཅེའམ།
en: ‘In these jungles I wander day and night’

source: །ཡང་ན་རྩྭ་འཇམ་བཏིང་ནས་ནི། །འདིར་ནི་འདུག་པར་བྱེད་ཅེས་ཟེར།
en: Or ‘This mat of fresh grass is where I sit.’

source: །རེས་འགའ་གྲོང་ཁྱེར་ཞུགས་གྱུར་ནས། །ཁྱིམ་པའི་དེར་ནི་ཕྱིན་པའི་ཚེ།
en: “At other times, when they go to cities and enter homes,

source: །གཡོ་སྒྱུས་ནན་ཏན་འདི་སྐད་དུ། །བདེ་འམ་ཞེས་ནི་འདྲི་བར་བྱེད།
en: They eagerly ask with deception, ‘Are you well?’

source: །འཇིག་རྟེན་པ་ཡི་འདུ་འཛིའི་གཏམ།
en: Before engaging in frivolous mundane conversations

source: །རྒྱལ་པོ་ཆོམ་རྐུན་ལ་སོགས་པའི། །སྣ་ཚོགས་དག་ནི་རྗོད་པར་བྱེད།
en: Related to various topics such as kings and thieves.

source: །རེས་འགའ་ཆགས་པའི་སེམས་དག་གིས།
en: “At other times, driven by attachment, They boast about their own qualities

source: །བུད་མེད་རྣམས་ཀྱི་མདུན་དག་ཏུ། །ཐབས་ནི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །རང་གི་ཡོན་ཏན་རྗོད་པར་བྱེད།
en: In various ways In the presence of women.

source: །བདག་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི། །བསོད་ནམས་ཞིང་ནི་ཆེན་པོ་བྱེད།
en: “They say, ‘I am a great field of merit for the entire world;

source: །བདག་ནི་རྒྱལ་ཐབས་རབ་སྤངས་ནས།
en: I have renounced my kingdom and become a renunciant,

source: །རབ་ཏུ་བྱུང་ནས་ལམ་སྒོམ་ཡིན།
en: And now I meditate on the path.

source: །བཙུན་མོ་དང་ནི་སྲས་རྣམས་ཀྱང་། །མཐོ་རིས་སྐྱེས་པར་གྱུར་ཅེས་ཟེར།
en: My queen and my children have been reborn in the higher realms.’

source: །དེ་དག་དེ་སྐད་ཐོས་ནས་ནི།
en: “Upon hearing those words,

source: །ཤིན་ཏུ་གུས་པ་རབ་བསྐྱེད་དེ།
en: The women are filled with immense respect;

source: །གོས་ཟས་དང་ནི་བཏུང་བ་དག །སྣ་ཚོགས་སྦྱར་ནས་མཆོད་པར་བྱེད།
en: They collect clothes, food, and beverages, which they offer with the words,

source: །བཙུན་པས་ཐུགས་རྗེར་རབ་དགོངས་ཤིང་། །བདག་ཅག་ཐད་དུ་ཡང་གཤེགས་ཟེར།
en: ‘Venerable, look upon us with compassion—please come to us directly!’

source: །རོ་ཞིམ་དག་ལ་ཞེན་ཆགས་ཤིང་།
en: “Since such people are attached to delicious meals

source: །ཉེས་དམིགས་རྣམས་ནི་མི་ཤེས་པས།
en: And do not know their defects,

source: །བདུད་ཀྱིས་གླགས་ཀྱང་རྙེད་འགྱུར་ཏེ།
en: They are at the mercy of Māra,

source: །རུ་སྦལ་རྒྱ་མོས་ཟིན་པ་འདྲ།
en: Like turtles caught in nets.

source: །དགོན་པར་གནས་པ་དག་ལ་ཡང་།
en: “Even while staying in the wilderness,

source: །རྙེད་པ་དག་གིས་སྙེམས་པར་བྱེད།
en: They are conceited about their achievements, And they continue to despise and deprecate

source: །དགེ་སློང་བརྩོན་འགྲུས་ཅན་དག་ལ།
en: Those monks who are diligent.

source: །བརྙས་ཤིང་སྐུར་པ་འདེབས་པར་བྱེད།
en: “Since they repeatedly give rise to attachment

source: །རྙེད་དང་གྲགས་པས་སེམས་རྨོངས་པས། །ཡང་ནས་ཡང་དུ་ཞེན་པ་སྐྱེད། །ལུས་ནི་ཡོངས་སུ་གསོ་བའི་ཕྱིར།
en: Out of the delusion related to gain and fame,

source: །རྟག་ཏུ་གཡོ་སྒྱུ་སྤྱོད་པས་ན།
en: And since they constantly engage in deceitful actions to sustain themselves,

source: །ལུས་དང་ངག་གི་མི་དགེ་ལས། །ཡང་ནས་ཡང་དུ་འཕེལ་བར་བྱེད།
en: They repeatedly increase their physical and verbal unwholesome actions.

source: །གལ་ཏེ་སྦྱིན་བདག་དད་པ་ཡིས། །དད་པའི་སེམས་ཀྱིས་མཆོད་ན་ཡང་།
en: “Even if benefactors make offerings to them out of faith,

source: །ལེ་ལོ་སྙོམ་ལས་དབང་གིས་ནི། །དེ་ཡི་བསོད་ནམས་འབྲི་བར་བྱེད།
en: Their merit will decrease through the power of their laziness.

source: །སྐྱེས་བུ་བླུན་པོ་དེ་དག་ནི། །རྟག་ཏུ་མི་དགེ་འདོད་བསྐྱེད་པས། །སྟོང་པ་ཉིད་ཀྱི་ཆོས་འདི་ལ།
en: Since those fools always long for nonvirtue,

source: །རྗེས་འཐུན་བཟོད་སེམས་འཐོབ་མི་འགྱུར།
en: They will never reach the acceptance that accords with emptiness. “For those who completely abandon those faults

source: །གང་དག་ང་ཡི་བསྟན་པ་ལས། །ཉེས་དམིགས་དེ་དག་རབ་སྤངས་ནས།
en: On the basis of my teachings

source: །ནན་ཏན་བག་ཡོད་སྒྲུབ་བྱེད་ན།
en: And practice with zeal and conscientiousness,

source: །ཆོས་འདི་ཐོས་པར་དཀའ་མི་འགྱུར།
en: It will not be difficult to hear this teaching. “For those who are unshaken by worldly concerns

source: །རྙེད་པ་དང་ནི་མི་རྙེད་དང་། །བསྟོད་སྨད་སྡུག་བསྔལ་བདེ་ལ་སོགས།
en: Such as gain, loss, praise, criticism,

source: །འཇིག་རྟེན་ཆོས་ཀྱིས་མི་གཡོས་པ།
en: Suffering, and happiness,

source: །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར།
en: It will not be difficult to receive this teaching.

source: །ལུས་ལ་མི་གཙང་འདུ་ཤེས་དང་། །ཕུང་པོ་རྨ་ཡི་འདུ་ཤེས་དང་། །ཟས་ནི་རྨ་བསྐུས་འདུ་ཤེས་པ།
en: “For those who perceive the body as filth, The aggregates as wounds, And food as poison for the wounds,

source: །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །གོས་བཟང་དག་ནི་ཐོབ་གྱུར་ཀྱང་།
en: It will not be difficult to receive this teaching.

source: །དྲེགས་པ་དག་ནི་མི་སྐྱེད་ཅིང་།
en: “For those who do not become haughty

source: །ངོ་ཚ་དགབ་པའི་ཕྱིར་གྱོན་པ།
en: But put on the attire of modesty Even when they receive fine clothes,

source: །གཟུགས་དང་སྟོབས་ནི་མི་སྙེམས་ཤིང་།
en: “For those who are not conceited about their appearance and strength,

source: །ཟས་ལ་ཆགས་པ་མེད་པ་དང་། །སྲོག་གནས་ཕྱིར་ནི་གང་ཟ་བ།
en: Who are not attached to food But merely eat to sustain their lives,

source: །སྲེད་པ་རྣམས་ནི་སྟོང་ཤེས་ནས།
en: “For those who know that the objects of craving are empty

source: །འདོད་པ་དག་ལ་བླང་དོར་མེད།
en: And therefore neither indulge in nor reject pleasures

source: །རྟག་ཏུ་སྟོང་དབེན་གང་སྤྱོད་པ།
en: But always act with the understanding of emptiness and disengagement,

source: །དཔག་ཚད་གཅིག་འདས་རི་ཁྲོད་དུ།
en: “For those living alone in the mountains—more than a league away—

source: །གཅིག་པུ་འདུག་ནས་མཉམ་བཞག་ཅིང་།
en: Who, while absorbed in equipoise,

source: །འདུས་བྱས་བདག་མེད་གང་རྟོགས་པ།
en: Realize the selflessness of conditioned phenomena,

source: །མི་ཟད་སྐྱེ་བའི་མཐའ་དག་དང་། མིག་འཇུག་མཚན་ཉིད་རྟོགས་བྱེད་ཅིང་། །མིག་གཙང་ལམ་ནི་རབ་སྒྲུབ་པ།
en: By realizing the characteristics of the limits Of the exhaustion, arising, and cognition of the eye,

source: །སྒྲ་དང་མིང་གི་བར་དུ་ཡང་།
en: Up to words and names.

source: །ཐམས་ཅད་ཀུན་ཀྱང་དེ་བཞིན་ནོ།
en: “You should know that,

source: །དེ་བཞིན་མ་འོངས་དུས་ཀྱི་ཚེ།
en: In the future,

source: །དགེ་སློང་དག་ནི་ཚད་མེད་སྙེད།
en: All the countless monks will be

source: །བརྩོན་པ་དང་ནི་ལེ་ལོ་ཅན།
en: Either diligent or lazy in those ways.

source: །ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས།
en: “You should know that, in those ways,

source: །དགེ་དང་མི་དགེའི་གྲོགས་པོ་དག །སྒྲུབ་པ་དང་ནི་མི་སྒྲུབ་པ།
en: They will either be virtuous or nonvirtuous friends, Accomplished or unaccomplished,

source: །ཡིད་ཆེས་པ་དང་ཡིད་མི་ཆེས།
en: Trusting or untrusting.

source: །དགེ་དང་མི་དགེའི་གྲོགས་པོ་དག །མིག་ཟད་ལམ་ནི་གང་ཡིན་པ།
en: Either virtuous or nonvirtuous friends

source: །སྒྲུབ་པ་དང་ནི་མི་སྒྲུབ་པ།
en: Who accomplish or do not accomplish The path of the eye’s exhaustion.

source: །གང་ཞིག་བྱང་ཆུབ་རབ་མོས་ཤིང་།
en: Some will be strongly interested in awakening, Only to lose interest later,

source: །ཟླ་གཅིག་གཉིས་གསུམ་འདས་ནས་ནི། །དུས་གཞན་ཕྱིར་ནི་གང་ལྡོག་པ།
en: After one, two, or three months have passed.

source: །གང་ཞིག་ཆོས་འདི་ཐོས་གྱུར་ནས། །མོས་པའི་སེམས་ནི་གང་བསྐྱེད་པ།
en: Born upon hearing this teaching

source: །གལ་ཏེ་ཉམས་པར་གྱུར་ན་ཡང་།
en: Declines in some,

source: །སླར་ནི་དད་པ་ཐོབ་པར་འགྱུར།
en: They will revive their faith later on. “Some will not abandon their carelessness

source: །གང་ཞིག་ཆོས་འདི་ཐོས་གྱུར་ནས། །བག་མེད་སྤོང་བར་མི་བྱེད་པ། །མདོ་འདི་སངས་རྒྱས་དཀའ་མ་ཡིན།
en: When they hear this teaching;

source: །དེ་སྙམ་དུ་ནི་སེམས་པར་འགྱུར།
en: Instead, they will think, ‘This discourse is not the Buddha’s words!’

source: །གང་ཞིག་ཆོས་འདི་ཐོས་གྱུར་ནས།
en: “After hearing this teaching,

source: །བདུད་ཀྱིས་ཡོངས་སུ་གང་བཟུང་བ།
en: Some will be caught by Māra;

source: །དང་པོ་དད་པ་སྐྱེས་གྱུར་ཀྱང་། །ཕྱིས་ནི་རབ་ཏུ་སྤོང་བར་འགྱུར།
en: Even if faith has initially arisen in them, They will abandon it later on.

source: །གང་ཞིག་ཆོས་ལ་མ་མོས་པ། །མི་བདེན་གྲགས་དང་རྙེད་པ་ཚོལ། །གྲོང་ཁྱེར་གྲོང་རྡལ་རབ་རྒྱུ་ཞིང་།
en: “Those who are not interested in the Dharma will pursue falsehood, fame, and gain;

source: །གཟུངས་རྣམས་དང་ནི་ཏིང་འཛིན་དང་། །ཀུན་འཛིན་འོད་ཟེར་བསྔགས་བརྗོད་ཀྱང་།
en: Although they might sing the praises of the lights Of dhāraṇīs, absorption, and complete comprehension

source: །དེ་ཡིས་ཡང་དག་རྟོགས་མི་འགྱུར།
en: As they roam through cities and towns, they will not gain true realization.

source: །འདོད་པ་ལྔ་པོས་བཅིངས་པ་དང་། །འཇིག་རྟེན་ལས་ནི་འདོད་ཚོལ་བ།
en: “Those who are bound by the five sense pleasures And pursue worldly activities

source: །བརྗོད་པ་དག་ནི་རྟོགས་བྱེད་པས།
en: Will involve themselves in concepts and statements,

source: །སྟོང་ཉིད་སྒོམ་ལ་སྐུར་པ་འདེབས།
en: And so denigrate the training in emptiness.

source: །དྲན་དང་ཤེས་རབ་སེམས་མེད་པས།
en: “Devoid of mindfulness and insight,

source: །ཚེ་ཚད་རབ་ཏུ་དོན་མེད་འདས།
en: Their whole life will be wasted in meaningless pursuits;

source: །བླུན་པོ་སྟོང་པའི་ཆོས་སྤོང་བ། །དེ་ནི་ཚུལ་ཁྲིམས་བགེགས་བྱས་པས།
en: The fools who abandon the Dharma of emptiness obstruct their discipline,

source: །མནར་མེད་དག་ཏུ་ལྟུང་བར་འགྱུར། །ནམ་ཡང་མཐོ་རིས་ཡོང་མི་སྐྱེ།
en: And so fall into the Hell of Unceasing Torment, never to be reborn in the higher realms.

source: །གང་གིས་སྐད་ཅིག་གཅིག་ལ་ནི།
en: “Someone who hears this discourse And memorizes a single four-line verse from it

source: །མཆོད་རྟེན་སྟོང་ནི་བྱས་པ་བས།
en: Is more exalted than someone who builds A thousand stūpas in every single moment.

source: །གང་གིས་མདོ་སྡེ་འདི་ཐོས་ནས།
en: “Someone who hears this discourse

source: །ཚིག་བཞི་ཚིགས་བཅད་གཅིག་འཛིན་འཕགས།
en: And memorizes a single four-line verse from it

source: །མེ་ཏོག་ཕྲེང་བ་བརྒྱ་སྟོང་དག །སངས་རྒྱས་མཆོད་རྟེན་མཆོད་པ་བས།
en: Is more exalted than someone who offers A hundred thousand flower garlands to the stūpas of the buddhas.

source: །ཚིག་བཞི་ཚིགས་བཅད་སེམས་པ་འཕགས།
en: For just a single moment

source: །གང་གིས་རིན་ཆེན་མཆོད་རྟེན་དག །གང་གཱའི་བྱེ་སྙེད་བྱས་པ་བས།
en: Is more exalted than someone who builds As many bejeweled stūpas as there are grains of sand in the Ganges. “Someone who contemplates this discourse

source: །གང་གིས་ཐ་ན་སྐད་ཅིག་ཙམ།
en: For just a single moment

source: །མདོ་སྡེ་འདི་སེམས་ཁྱད་པར་འཕགས།
en: Is more exalted than someone who venerates

source: །སངས་རྒྱས་ཞིང་ནི་འབུམ་ཕྲག་བརྒྱ། །མེ་ཏོག་གཏོར་ནས་མཆོད་པ་བས།
en: Ten million buddha realms by tossing flowers. “Someone who contemplates this discourse

source: །ཆོས་གོས་འབུམ་ཕྲག་བརྒྱ་མང་པོ། །སངས་རྒྱས་རྣམས་ལ་ཕུལ་བ་བས། །གང་གིས་ཐ་ན་སྐད་ཅིག་ཙམ། །མདོ་སྡེ་འདི་སེམས་ཁྱད་པར་འཕགས།
en: Ten million Dharma robes to the buddhas.

source: །སངས་རྒྱས་སྤྱན་ནི་རྣམ་དག་འཕགས།
en: “The buddha eye is pure and superior—

source: །མི་མཁྱེན་མི་གཟིགས་གང་ཡང་མེད།
en: There is nothing that it does not know and see.

source: །གང་གིས་མདོ་སྡེ་འདི་མོས་ན།
en: Those who are dedicated to this discourse

source: །སངས་རྒྱས་སྤྱན་ནི་ཐོབ་པར་འགྱུར།
en: Will achieve the buddha eye.

source: །འདས་པའི་བསྐལ་པ་གྲངས་མེད་ཚེ།
en: “Countless eons ago,

source: །སངས་རྒྱས་མར་མེ་མཛད་པ་བྱུང་།
en: The Buddha Dīpaṅkara appeared.

source: །ང་ནི་བྲམ་ཟེའི་ཁྱེ་འུར་གྱུར།
en: I was at that time the child of a brahmin,

source: །མེ་ཏོག་ཐོགས་ནས་མཆོད་པ་བྱས།
en: And I worshiped him by holding up flowers. “He prophesied that I would become a buddha

source: །ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ།
en: Named Śākyamuni, And that I would teach this discourse

source: །བྱང་ཆུབ་སྙིང་པོ་ལ་འདུག་ནས། །མདོ་སྡེ་འདི་ནི་སྟོན་འགྱུར་ཞེས། །ང་ལ་བྱང་ཆུབ་ལུང་ཡང་བསྟན།
en: While sitting at the seat of awakening.

source: །ཁྱོད་ནི་དེ་ཚེ་གཞོན་ནུར་གྱུར།
en: “You were a young boy at that time.

source: །ད་ལུང་བསྟན་པ་ཐོས་གྱུར་ནས།
en: When you heard this prophecy,

source: །དགའ་ཞིང་དད་པའི་སེམས་བསྐྱེད་དེ།
en: You became overjoyed and filled with faith.

source: །ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་དུ།
en: With your palms joined, you made this aspiration:

source: །གལ་ཏེ་བྲམ་ཟེའི་ཁྱེའུ་འདི་ནི། །མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཚེ།
en: ‘When this brahmin child becomes a perfect buddha,

source: །བདག་ནི་དེ་ཡི་གྲོགས་གྱུར་ནས།
en: May I become his assistant.

source: །མྱ་ངན་འདས་པའི་འོག་ཏུ་ཡང་།
en: After he passes into nirvāṇa,

source: །ཆོས་ཀྱི་སྡེ་སྣོད་རབ་འཛིན་ཅིང་། །སྲུང་བར་ཤོག་ཅེས་སྨོན་ལམ་བཏབ།
en: May I uphold and guard his collection of teachings!’

source: །སངས་རྒྱས་མར་མེ་མཛད་དེ་ཡིས།
en: “When the Buddha Dīpaṅkara

source: །འོད་ཟེར་སྟོན་པའི་མདོ་འདི་ནི། །ཇི་སྐད་གསུངས་བཞིན་དེ་ཡི་ཚེ།
en: Taught this discourse on the manifestation of lights,

source: །བྲམ་ཟེའི་ཁྱེའུ་དང་གཞོན་ནུ་གཉིས།
en: Both the brahmin son and the young boy

source: །ལེགས་པར་མཉན་ཅིང་ཡོངས་སུ་བཟུང་།
en: Listened to it carefully and kept it in mind.

source: །ང་སྔོན་འདས་པའི་དུས་ཀྱི་ཚེ། །མེ་ཏོག་ཨུད་པ་ལ་དག་གིས། །སངས་རྒྱས་དེ་ལ་མཆོད་པ་བྱས།
en: “In the past, I once offered blue lotus flowers to that buddha.

source: །དེ་ཚེ་ཁྱོད་ཀྱང་དེར་འདུག་སྟེ། །འདི་སྐད་དུ་ནི་སྨོན་ལམ་བཏབ།
en: You were present at that time, and you made the aspiration

source: །ང་ཡི་བསྟན་པ་ཐ་མ་ལ། །མདོ་སྡེ་འདི་ནི་རབ་བཟུང་ནས།
en: To uphold this discourse during the final period of my teachings

source: །རྒྱ་ཆེར་སྟོན་པར་ཤོག་ཅེས་སྨྲས།
en: And to propagate it on a vast scale.

source: །གང་གིས་ཆོས་འདི་ཐོས་གྱུར་ནས།
en: “Those who, upon hearing this teaching,

source: །ཞེ་སྡང་སེམས་ནི་མི་སྐྱེད་པར།
en: Do not give rise to aversion but hold it,

source: །གཟུང་འཛིན་ཀློག་ཅིང་གང་འདོན་པ།
en: Keep it in mind, read it, and recite it

source: །དེ་ནི་སྐྱེས་བུ་དམ་པ་ཡིན།
en: Are sublime beings!

source: །ཁྱོད་ཀྱིས་མ་འོངས་དུས་ཀྱི་ཚེ།
en: “In the future, you should uphold

source: །ཐོས་དཀའི་ཆོས་འདི་རབ་བཟུང་ནས། །སེམས་ཅན་དག་ལ་དོན་གྱི་ཚུལ།
en: This teaching that is difficult to hear,

source: །རྒྱ་ཆེར་དབྱེ་ཞིང་བསྟན་པར་བྱ།
en: Teach it extensively, and reveal its meaning To sentient beings!

source: །ངས་ཀྱང་འདས་པའི་དུས་ཀྱི་ཚེ།
en: “In the past,

source: །ཡང་དག་ཆོས་ནི་ནུབ་པ་ན།
en: When the true Dharma was about to disappear,

source: །འོད་ཟེར་སྟོན་པའི་མདོ་འདི་ནི།
en: I also taught this discourse on the manifestation of lights

source: །སེམས་ཅན་དག་ལ་རྒྱ་ཆེར་བསྟན།
en: Extensively to sentient beings.

source: །བླུན་པོས་ནན་ཏན་མི་སྒྲུབ་པས།
en: “Because fools do not accomplish it with determination,

source: །འདི་ལ་སྐུར་བ་འདེབས་པར་བྱེད།
en: They deprecate it.

source: །ངས་ནི་དེ་སྐད་ཐོས་གྱུར་ཀྱང་།
en: Still, when I hear their words,

source: །ཞེ་སྡང་དག་ནི་སྐྱེད་མི་བྱེད།
en: I do not become angry.

source: །ངས་ནི་རྟག་ཏུ་བཟོད་བསྒོམས་ནས།
en: “Instead, I always cultivate patience

source: །འཇིག་རྟེན་རྣམས་ལ་ཕན་འདོགས་བྱེད།
en: And benefit the world.

source: །བཟོད་པའི་སྟོབས་ནི་རྫོགས་པས་ན།
en: Since the strength of my patience is perfect,

source: །མཚན་དང་དཔེ་བྱད་དག་གིས་བརྒྱན།
en: I am adorned with the major and minor marks.

source: །གཞོན་ནུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་སྐུ།
en: “Kumāra, you should regard the excellent

source: །གྱ་ནོམ་ཡོངས་སུ་རྫོགས་གྱུར་ཅིང་།
en: And perfect body of the Buddha,

source: །གསེར་གྱི་ཁ་དོག་རྣམ་དག་འཕགས།
en: As well as his pure and sublime golden color,

source: །བཟོད་པའི་སྟོབས་ལས་བྱུང་བར་ལྟོས།
en: As the outcome of the strength of his patience. “Countless realms shake

source: །ང་ཡི་ཞབས་ནི་ས་རེག་ནས། །ཞིང་ནི་ཚད་མེད་གཡོ་བྱེད་ཀྱང་།
en: When my feet touch the earth,

source: །སེམས་ཅན་རྣམས་ནི་མི་ལྟུང་བ།
en: Yet no sentient being loses balance;

source: །ཐམས་ཅད་བཟོད་པའི་སྟོབས་ལས་སྐྱེས། །ང་ཡི་སྤུ་ཁུང་གཅིག་ནས་ནི།
en: All this is the outcome of the strength of my patience.

source: །འོད་ཟེར་བརྒྱ་སྟོང་རབ་བཀྱེ་ནས།
en: “The hundred thousand light rays Emitted from each pore of my hair

source: །ཐམས་ཅད་གསལ་བར་གང་བྱེད་པ།
en: Illuminate all directions;

source: །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་བྱུང་།
en: All this is the outcome of the strength of my supreme patience.

source: །སྲིན་པོ་བཞིན་དུ་འཇིགས་པའི་གཟུགས།
en: “Creatures with frightening appearances such as rākṣasas,

source: །སྲོག་ཆགས་གཟི་བྱིན་འཕྲོག་བྱེད་པ།
en: As well as ravishing and majestic beings,

source: །ང་ལ་རྟག་ཏུ་གུས་པ་ཡང་།
en: All show reverence to me;

source: །ང་ཡི་འཁོར་ནི་ཇི་སྙེད་པ།
en: “All the members of my retinues

source: །སེམས་ནི་རབ་ཏུ་དུལ་གྱུར་ནས།
en: Have developed gentle minds,

source: །དེ་བཞིན་གཤེགས་ལ་གུས་པ་ཡང་།
en: And they revere the Thus-Gone One;

source: །རོལ་མོའི་སྒྲ་ནི་བརྒྱ་སྟོང་དག །འཁོར་འདུས་ཆེན་པོའི་ནང་དག་ཏུ། །སངས་རྒྱས་ཡོན་ཏན་བསྔགས་བརྗོད་པ།
en: Proclaimed within my great assemblies With a hundred thousand musical tunes,

source: །ཀླུ་ཡི་རྒྱལ་པོ་བརྒྱ་སྟོང་དག །རབ་ཏུ་གདུག་ཅིང་འཇིགས་རུང་བ།
en: “A hundred thousand malevolent And frightening nāga kings

source: །སངས་རྒྱས་མཐོང་ན་དགའ་བ་ཡང་།
en: Become pleased when they see the Buddha;

source: །སྲིན་པོ་གནོད་སྦྱིན་ལ་སོགས་པས།
en: “Beings such as rākṣasas and yakṣas

source: །མེ་ཏོག་ཕྲེང་བ་བརྒྱ་སྟོང་ཐོགས། །འོངས་ནས་ང་ལ་མཆོད་བྱེད་པ།
en: Come to me carrying hundreds of thousands Of flower garlands to worship me;

source: །ཞིང་ནི་བརྒྱ་སྟོང་ཚད་མེད་པར། །བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས།
en: In countless hundreds of thousands of realms

source: །ང་ཡི་ཡོན་ཏན་བསྔགས་པ་ཡང་།
en: Are praising my qualities;

source: །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་བྱུང་། །ལྟོ་འཕྱེ་དང་ནི་ལུས་སྲུལ་པོ།
en: All this is the outcome of the strength of my supreme patience.

source: །བརྒྱ་སྟོང་དག་ནི་འདུས་གྱུར་ནས།
en: “Hundreds of thousands of mahoragas And kaṭapūtanas gather together

source: །མེ་ཏོག་གཏོར་ནས་ང་མཆོད་པ།
en: And worship me by tossing flowers;

source: །གནོད་སྦྱིན་རྒྱལ་པོ་ལ་སོགས་པ། །བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་རྣམས།
en: “Sixty billion beings Including the yakṣa kings

source: །འོངས་ནས་ང་ལ་གང་མཆོད་པ།
en: Come to worship me;

source: །གཞན་ཡང་ཀླུ་ཡི་རྒྱལ་པོ་ནི།
en: “The kings of the nāgas

source: །མ་ན་བ་ག་ལ་སོགས་པས།
en: Such as Manavaka
